Revit 2027 API
BuiltInFailures.SketchFailures.LoopsOutsideFaceSplit Property
 Some of the lines drawn lie outside of the boundary of the face being split. All lines used to split a face must be contained within the face being split and cannot intersect or overlap any of the boundaries of that face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LoopsOutsideFaceSplit { get; }
Public Shared ReadOnly Property LoopsOutsideFaceSplit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LoopsOutsideFaceSplit {
	FailureDefinitionId^ get ();
}
static member LoopsOutsideFaceSplit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace